In [1]:
import pandas as pd

In [2]:
import numpy as np

In [2]:
#1 
a=pd.Series([1,2,3,4,5])
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
a.ndim

1

In [4]:
b=list(a)
b

[1, 2, 3, 4, 5]

In [5]:
type(b)

list

In [6]:
#3
z=pd.Series([2,4,6,8,10])
z

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [7]:
a+z

0     3
1     6
2     9
3    12
4    15
dtype: int64

In [8]:
z-a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
z*a

0     2
1     8
2    18
3    32
4    50
dtype: int64

In [10]:
z/a

0    2.0
1    2.0
2    2.0
3    2.0
4    2.0
dtype: float64

In [16]:
#4 
a.equals(other=z)

False

In [3]:
#5
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.NaN, 9, 20, 14.5, np.NaN, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
            }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [42]:
#6 
df[['score','attempts']].loc[['a','c','e','f']]

   score  attempts
a   12.5         1
c   16.5         2
e    9.0         2
f   20.0         3

In [15]:
#7
a=[]
for i in list(df.index):
    if 15<=df.score[i]<=20:
        a.append(i)
df.loc[a]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [17]:
#8
q=[]
for i in list(df.index):
    if (15<=df.score[i]) & (df.attempts[i]<2):
        q.append(i)
df.loc[q]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [23]:
#9
df.sort_values('name',ascending=False)

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [21]:
df.sort_values('score')

        name  score  attempts qualify
i      Kevin    8.0         2      no
b       Dima    9.0         3      no
e      Emily    9.0         2      no
a  Anastasia   12.5         1     yes
g    Matthew   14.5         1     yes
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
f    Michael   20.0         3     yes
d      James    NaN         3      no
h      Laura    NaN         1      no

In [26]:
#10
df['class']='11th'
df

        name  score  attempts qualify class
a  Anastasia   12.5         1     yes  11th
b       Dima    9.0         3      no  11th
c  Katherine   16.5         2     yes  11th
d      James    NaN         3      no  11th
e      Emily    9.0         2      no  11th
f    Michael   20.0         3     yes  11th
g    Matthew   14.5         1     yes  11th
h      Laura    NaN         1      no  11th
i      Kevin    8.0         2      no  11th
j      Jonas   19.0         1     yes  11th

In [27]:
#11
df

        name  score  attempts qualify class
a  Anastasia   12.5         1     yes  11th
b       Dima    9.0         3      no  11th
c  Katherine   16.5         2     yes  11th
d      James    NaN         3      no  11th
e      Emily    9.0         2      no  11th
f    Michael   20.0         3     yes  11th
g    Matthew   14.5         1     yes  11th
h      Laura    NaN         1      no  11th
i      Kevin    8.0         2      no  11th
j      Jonas   19.0         1     yes  11th

In [31]:
df.name.loc['d']='Suresh'
df

        name  score  attempts qualify class
a  Anastasia   12.5         1     yes  11th
b       Dima    9.0         3      no  11th
c  Katherine   16.5         2     yes  11th
d     Suresh    NaN         3      no  11th
e      Emily    9.0         2      no  11th
f    Michael   20.0         3     yes  11th
g    Matthew   14.5         1     yes  11th
h      Laura    NaN         1      no  11th
i      Kevin    8.0         2      no  11th
j      Jonas   19.0         1     yes  11th